{
	"id": "52",
	"manufacturer": "Reitz-Group.de",
	"label": "064459",
	"description": "Düwi Remote Control",
	"category": "23",
	"type_id": "5001:0000",
	"versionmin": "0.000",
	"versionmax": "255.255",
	"library_type": "0",
	"protocol_version": "0.000",
	"listening": "0",
	"frequently_listening": "0",
	"routing": "0",
	"beaming": "0",
	"security": "0",
	"max_baud": "0",
	"basicclass": null,
	"genericclass": null,
	"specificclass": "SPECIFIC_TYPE_NOT_USED",
	"certification": "",
	"thingid": "064459",
	"db_version": "0",
	"info_overview": "<p>The DUWI Remote Control controls Z-Wave actuators such as dimmers, switches, thermostats or motor controls for blinds or jalousies. Devices can be turned on and off but dimmers and motor controls can also be turned into a desired dimming level to motor position by keeping a button pushed and releasing it. Additionally the device can act as a primary controller of a Z-Wave network using three dedicated network control buttons located behind a sliding cover. 10 pair of buttons - illuminated by blue light when operated - allow to control up to 7 control groups (association groups) and 3 scenes. The scenes learn the desired status of selected actuators and can turn them back into this status just hitting a button. The devices in the 7 control groups a re always switched simultaneously. The remote control can operate as a secondary control beside an IP-Gateway however it is not possible from this device to activate scenes defined in the IPGateway. All scenes and control groups are stored within the remote control and they are also conveniently programmed using the buttons of the remote rather than using wireless commands from an IP-Gateway. </p>",
	"info_inclusion": "<p>Push the \"Include\" button for 2 seconds to include the device into an existing the Z-Wave network. For Inclusion of Z-Wave devices into the remote controls network press 3 times the \"Inclusion\" button on the backside of the remote control and confirm by pressing the dedicated button on the target.</p>",
	"info_exclusion": "<p>Press and hold the \"Exclusion\" button on the backside of the device for 2 seconds. Confirm by pressing the dedicated button on the target (send NIF). </p>",
	"info_wakeup": "<p>This device will wakeup regularly and announce the wakeup state by sending out a so called Wakeup Notification. The controller can then empty the mailbox. Therefore, the device needs to be configured with the desired wakeup interval and the node ID of the controller. If the device was included by a static controller this controller will usually perform all necessary configurations. The wakeup interval is a tradeoff between maximal battery life time and the desired responses of the device. Pressing the \"INCL.\" button for 2 seconds will wake up the device. It is possible to set the node ID to 255 to send wakeup notifications as broadcast. In this mode device takes more time to go to sleep and drains battery faster, but can notify all it's direct neighbors about a wakeup.</p>",
	"info_usage": "",
	"first_approval_time": "0000-00-00 00:00:00",
	"last_update_time": "2018-08-23 21:59:39",
	"last_update_by": "1944",
	"last_approve_time": "0000-00-00 00:00:00",
	"last_export_time": "0000-00-00 00:00:00",
	"approved_export": "",
	"created_by": "1944",
	"ordering": "0",
	"state": "0",
	"deleted": "0",
	"locked": "0",
	"checked_out": "0",
	"checked_out_time": "0000-00-00 00:00:00",
	"image": "",
	"manufacturer_id": "11",
	"manufacturer_ref": "100",
	"manufacturer_thingid": "reitz",
	"manufacturer_url": "",
	"category_id": "RemoteControl",
	"category_label": "Remote Control",
	"category_description": "Any portable or hand-held device that controls the status of something, e.g. remote control, keyfob etc.",
	"basicclass_id": null,
	"genericclass_id": null,
	"specificclass_id": null,
	"versions": "All",
	"versionminDisplay": "0.0",
	"versionmaxDisplay": "255.255",
	"library_type_desc": "Unknown",
	"parameters": [],
	"associations": [],
	"documents": [
		{
			"id": "1605",
			"device": "52",
			"file": "DUW-064459.pdf",
			"label": "064459",
			"created_by": "1944",
			"ordering": "1588",
			"state": "0",
			"checked_out": "0",
			"checked_out_time": "0000-00-00 00:00:00"
		},
		{
			"id": "1606",
			"device": "52",
			"file": "z-wave-duwi-remote-control-3360-p.jpg",
			"label": "Image",
			"created_by": "1944",
			"ordering": "1589",
			"state": "0",
			"checked_out": "0",
			"checked_out_time": "0000-00-00 00:00:00"
		}
	],
	"endpoints": [],
	"changelog": [],
	"xml": [],
	"user_owned": false,
	"database_id": "52",
	"errors": [
		"No endpoints are configured"
	],
	"warnings": [],
	"notices": []
}